Hello @jordischoots and thanks for reporting this.

I have taken your configuration, cut and paste it in a file, and then applied: I can't reproduce the issue.

This is the output:

```shell
$> mkdir test

$> cd test/

$> touch main.tf

$> subl main.tf

$> terraform init

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/tls...
- Finding latest version of hashicorp/local...
- Installing hashicorp/tls v3.3.0...
- Installed hashicorp/tls v3.3.0 (signed by HashiCorp)
- Installing hashicorp/local v2.2.2...
- Installed hashicorp/local v2.2.2 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - tfzk/zookeeper in /Users/idemarino/go/1.18.0/bin
│
│ Skip terraform init when using provider development overrides. It is not necessary and may error unexpectedly.
╵

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

$> terraform plan
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - tfzk/zookeeper in /Users/idemarino/go/1.18.0/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.private_key will be created
  + resource "local_sensitive_file" "private_key" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "mysshkey"
      + id                   = (known after apply)
    }

  # local_sensitive_file.public_key will be created
  + resource "local_sensitive_file" "public_key" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "mysshkey.pub"
      + id                   = (known after apply)
    }

  # tls_private_key.generate_ssh will be created
  + resource "tls_private_key" "generate_ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 3 to add, 0 to change, 0 to destroy.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.

$> terraform apply
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - tfzk/zookeeper in /Users/idemarino/go/1.18.0/bin
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_sensitive_file.private_key will be created
  + resource "local_sensitive_file" "private_key" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0600"
      + filename             = "mysshkey"
      + id                   = (known after apply)
    }

  # local_sensitive_file.public_key will be created
  + resource "local_sensitive_file" "public_key" {
      + content              = (sensitive value)
      + directory_permission = "0700"
      + file_permission      = "0700"
      + filename             = "mysshkey.pub"
      + id                   = (known after apply)
    }

  # tls_private_key.generate_ssh will be created
  + resource "tls_private_key" "generate_ssh" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 4096
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tls_private_key.generate_ssh: Creating...
tls_private_key.generate_ssh: Creation complete after 1s [id=4ade39b9a48c555a6c70eda97d286a72c03f6fc1]
local_sensitive_file.public_key: Creating...
local_sensitive_file.private_key: Creating...
local_sensitive_file.public_key: Creation complete after 0s [id=e036beedd9a3d4c7cfb91915efbff319a41e4a94]
local_sensitive_file.private_key: Creation complete after 0s [id=daf2519fb161c6ef10652a6c1db3b13a15df3f62]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

$> ls -l
total 56
-rw-r--r--  1 idemarino  staff    601  5 May 17:52 main.tf
-rw-------  1 idemarino  staff   3361  5 May 17:53 mysshkey
-rwx------  1 idemarino  staff    725  5 May 17:53 mysshkey.pub*
-rw-r--r--  1 idemarino  staff  14991  5 May 17:53 terraform.tfstate

$> cat mysshkey
-----BEGIN OPENSSH PRIVATE KEY-----
b3BlbnNzaC1rZXktdjEAAAAABG5vbmUAAAAEbm9uZQAAAAAAAAABAAACFwAAAAdz
c2gtcnNhAAAAAwEAAQAAAgEA4QviZipKSXHyuTLqlUiGU7EAVwlFDSWenX+X3AdF
Go13Y9aS3D/WVvV96eHDI+mckSZ/I9sNCh3SV0+uXVTpumX8jVj7aEW+b7pwLaVR
hoWYa49dOWbMDO3GT7JKkRxtpow8jYcpLLosdFsUo2CG4nkyd7lemI58EkCGnjd6
W+sVWc8HaaP0tULVK9Z9PdxCwEpe53yklVLXqg02e94VStdF7DqbUzBPqKl9BWv2
2K2HUNH7zWpyigO35Y+P1uNnBqD6EtoLq23JsFMYrD6ywkW8n4BcUPmsKiHzpNNJ
VgNTniUJoocm12B/RuB3GbKM5F6YrpjFy80TuTraOhgRHdw6db8SOx13TMz2Z+ka
OSfFUiWBnZu9XrV6ZybtZhtL6lA01e0PuSg320IZrUCqWlGNUXEt0B3t/n7g+MAF
4StUvXFNqL3wI3VZdSn6bbw7/CHOdfGSpvAeFAiwqkjgSkSMdT5nxNFIPumhPa4F
O3sk/WobkpDj89OsbMdhy9bWy9yjiaEyUjRnu1oowX+RT674NZTI98diip7Np/mW
IDkMSkDawokGczFMGyVTYxrCILEvDAtMDDI/NgnJ9Wujqil5t+xkTv610cj2lZr/
hTKd2B5LfuSmMOkwDeZyxk9k3QzuIP/vBIur44Fd/2cOoO8rZz0u9IdETltZB0h6
J3MAAAc4HBH7oxwR+6MAAAAHc3NoLXJzYQAAAgEA4QviZipKSXHyuTLqlUiGU7EA
VwlFDSWenX+X3AdFGo13Y9aS3D/WVvV96eHDI+mckSZ/I9sNCh3SV0+uXVTpumX8
jVj7aEW+b7pwLaVRhoWYa49dOWbMDO3GT7JKkRxtpow8jYcpLLosdFsUo2CG4nky
d7lemI58EkCGnjd6W+sVWc8HaaP0tULVK9Z9PdxCwEpe53yklVLXqg02e94VStdF
7DqbUzBPqKl9BWv22K2HUNH7zWpyigO35Y+P1uNnBqD6EtoLq23JsFMYrD6ywkW8
n4BcUPmsKiHzpNNJVgNTniUJoocm12B/RuB3GbKM5F6YrpjFy80TuTraOhgRHdw6
db8SOx13TMz2Z+kaOSfFUiWBnZu9XrV6ZybtZhtL6lA01e0PuSg320IZrUCqWlGN
UXEt0B3t/n7g+MAF4StUvXFNqL3wI3VZdSn6bbw7/CHOdfGSpvAeFAiwqkjgSkSM
dT5nxNFIPumhPa4FO3sk/WobkpDj89OsbMdhy9bWy9yjiaEyUjRnu1oowX+RT674
NZTI98diip7Np/mWIDkMSkDawokGczFMGyVTYxrCILEvDAtMDDI/NgnJ9Wujqil5
t+xkTv610cj2lZr/hTKd2B5LfuSmMOkwDeZyxk9k3QzuIP/vBIur44Fd/2cOoO8r
Zz0u9IdETltZB0h6J3MAAAADAQABAAACAHJL++dRkTsuEU24K2Y4WGjHG9oYjiZ4
Nc/eDr2kP5eVw85EG4CbN3wg4JtZmydxLaCWwbnvNfcuYDcR9AfY6YBO7e7IA5/Y
1Digovq73OUKkvgF7x4JNJdYaADwF2kN3C7bSKHExMe/onZSD/BORRNe5J/j2MR4
kVEfzn8qxA1NHyHmwOgJam5pDCVgoWk6pfhNjVfaeSiR05C9dy+AAqZpIU0yEtM0
VTDfK+0GAW/Y6kHE9DNG3fd0ngCMYkyMYDYAqiHK9mRRtT7FZWGN0nJSwtLreXdy
5trbNYg/+x4hQGWwf+044SRAEURpGnRFt8MAvGDonIS+mkbYOh+JO59PxFRhulBm
tQu8XQjNsdfU3zlbhZnhfZE6/4WUF6QeO7c2IFGIx2yxHtje9yM09Z4GRxHuRp3b
a2x1k2pDPBm85mA2Y0ncrayY3xrZxrylIBMJaHi1rvEdHg12lGk+uzByFuN0pvxp
jAy3TiNwKgUg6hiQl02rqlf/AK7p46NJBvwm4Tg5QwuBZj8IfLWUmk4wFqRq14sQ
CjQu06U7nc6mgOVD/jyYkG10tK9FAh7u+4XNPOVUpNvbsj3Ls2srKHHG9uZrsg7n
Z0g6Cs0G4MhSzlBHMP6sEWtjDml1Z+AV/tFzuxCDC5yR687F5qx+LDgDApiA3xjf
eYWyvgu9XNdBAAABAGAUwlkaDnDySEiJKJa74XSE6u0rw5HMJxJESb5mW/83nN0t
CEHu1nbebF2V8Z8uQ45N3ZlrgDMsx0RqHLtNX5nPzB4H2jgOgPfe7GkZDCKz4rJF
XRRBd3tJkj86hX0yu2fTnFC12xT5OEBjbjZyUOmtMrUtBYL4WuNmeNXC2aHaZEVS
u3FWtE96c4MwkO8ezBIwIGB140f+XYdevtPmMnS9WzI1T0OPOzJoWFqKaRRLyAEv
AadGHkKajzCF6nnDgmPosWmhKXsosEGM/ofAyAEhdd3ns2Qz5dMKxtNezt7k6++w
VqGO51oEpQLgzm5mPTuuXq1FrCV/iXuIDJG/JbkAAAEBAPpdoVfnwLFgbRyTWYrL
WW+uNgKF/yGiwElQ2rYnD14mrkuFFpyRdJQ0h+r+chG0fEL/fP32Ktv45kRKaQ82
UqKMQdK3CWCPNaaHx4UvsuCQs91okNvqL8uPAIc31FpbJh24Ci1rb2KHDEbAV6Iv
Cv8ksCMIGhpQbQZ2XQF2Xf8vMmsnegOxuV6lZ9s1V/okA2NXOiIK74q6c1AVIokw
/wup/Y56l8VOi9RXlQ88ojQTHw0W7UgKQJlcAZsHff2tAOvbcSoDugcCRdoAQh7w
jgdioVZFTiw6MLE8kGH96nQmhhQ08Q+62cOj1LcA+/mbnccbgKUADAgpaMbYHtD5
ziEAAAEBAOYcY2OFzU1KYMYveGScIKJ2WvmuhRSAGxGT66UC6af9BY0AG2pMICoA
bwmcOdJEnAtkaVM11FPEmF0LoyL3vkX2Ju8cYpbrccirHfNp/rvKmXOGhwsvdknj
9X9paJfcS8Y75/tcybgAbLuDrw9TLwn4bh0TYFImn1lemDmi8Elzbc4DlgOxTo7h
HEp18C7lCRZMuMUXfxN905JAG60OCmbBeriznIyIv8iNpakr5Z4s9Vg9HDhyFY0S
uYNa2jHkEnPX5zsISmIHtL92ISQK2WRTVTIq7J9ZF648IxAr36oe8OXoJ78SXhHP
Tp8gwAvpjATPE2ZHRpXt6uh0VkcmexMAAAAAAQID
-----END OPENSSH PRIVATE KEY-----

$> cat mysshkey.pub
ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDhC+JmKkpJcfK5MuqVSIZTsQBXCUUNJZ6df5fcB0UajXdj1pLcP9ZW9X3p4cMj6ZyRJn8j2w0KHdJXT65dVOm6ZfyNWPtoRb5vunAtpVGGhZhrj105ZswM7cZPskqRHG2mjDyNhyksuix0WxSjYIbieTJ3uV6YjnwSQIaeN3pb6xVZzwdpo/S1QtUr1n093ELASl7nfKSVUteqDTZ73hVK10XsOptTME+oqX0Fa/bYrYdQ0fvNanKKA7flj4/W42cGoPoS2gurbcmwUxisPrLCRbyfgFxQ+awqIfOk00lWA1OeJQmihybXYH9G4HcZsozkXpiumMXLzRO5Oto6GBEd3Dp1vxI7HXdMzPZn6Ro5J8VSJYGdm71etXpnJu1mG0vqUDTV7Q+5KDfbQhmtQKpaUY1RcS3QHe3+fuD4wAXhK1S9cU2ovfAjdVl1KfptvDv8Ic518ZKm8B4UCLCqSOBKRIx1PmfE0Ug+6aE9rgU7eyT9ahuSkOPz06xsx2HL1tbL3KOJoTJSNGe7WijBf5FPrvg1lMj3x2KKns2n+ZYgOQxKQNrCiQZzMUwbJVNjGsIgsS8MC0wMMj82Ccn1a6OqKXm37GRO/rXRyPaVmv+FMp3YHkt+5KYw6TAN5nLGT2TdDO4g/+8Ei6vjgV3/Zw6g7ytnPS70h0ROW1kHSHoncw==
✔0 20220505-165328 idemarino@idemarino-DLJFC23KF4 ~/Workspaces/test
```

Can you please verify?